In [91]:
from prettytable import PrettyTable
import random
import pandas as pd
import csv
import numpy

In [92]:
table = PrettyTable()
data = pd.read_csv('random_names_fossbytes.csv')
data.columns=['names']

In [93]:
data

                  names
0     Marvin Mclaughlin
1          Joshua Doyle
2            Grace Mays
3          Randy Massey
4        Bryan Mcdaniel
...                 ...
1994     Marie Robinson
1995      Melissa Mills
1996      Elizabeth Lee
1997         Anne Colon
1998      Laura Skinner

[1999 rows x 1 columns]

In [94]:
names = data['names'].tolist()

table.field_names = ['Name', 'No', 'Status']
for i in range(len(names)):
    pd.DataFrame(table.add_row([random.choice(names), random.randint(1,23), random.choice(['Married', 'Single'])]))

In [95]:
print(table[1000])

+-------------+----+---------+
|     Name    | No |  Status |
+-------------+----+---------+
| Rachel Ford | 7  | Married |
+-------------+----+---------+

In [105]:
with open('names.csv', 'w') as csvfile:
    csvfile.write(table.get_string())
    csvfile.close

In [109]:
new_data = pd.read_csv('names.csv', delimiter='|')
new_data.head()

<ipython-input-109-0141e537d3d4>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  new_data = pd.read_csv('names.csv', delimiter=r'\n')

   +--------------------------+----+---------+
0  |           Name           | No |  Status |
1  +--------------------------+----+---------+
2  |     Christina Wilson     | 6  | Married |
3  |       Mark Mendez        | 3  | Married |
4  |      Jessica Melton      | 12 |  Single |

In [ ]:

new_data.iloc[-1:]

                                                        +-------------------------+----+---------+
+-------------------------+----+---------+ NaN NaN NaN                                         NaN